app/controllers/shoes_controller.rb

    def index
        shoes = Shoe.all
---
SELECT "shoes".* FROM "shoes"

    def show
        shoe = Shoe.find(params[:id])
---
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def create
        shoe = Shoe.new(shoe_params)

        if shoe.save
---
INSERT INTO "shoes" ("name", "brand", "year") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KOBE"], ["brand", "Nike"], ["year", 2019]]

      def update
        shoe = Shoe.find(params[:id])
        shoe.update(shoe_params)
---
SELECT "shoes".* FROM "shoes" WHERE "shoes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "shoes" SET "year" = $1 WHERE "shoes"."id" = $2  [["year", 2019], ["id", 19]]

      def destroy
        shoe = Shoe.destroy(params[:id])
---
DELETE FROM "shoes" WHERE "shoes"."id" = $1  [["id", 8]]